import React, { useState } from "react";

const faqData = [
  {
    question: "מהי רפלקסולוגיה?",
    answer:
      "רפלקסולוגיה היא שיטת טיפול משלימה המתמקדת בלחיצות ונגיעה בנקודות בכפות הרגליים, הידיים או האוזניים - אשר משקפות את מערכות הגוף. טיפול זה מסייע לגוף שיצא מאיזון, לחזור אליו. משפר את תפקוד האיברים על ידי הפחתת מתחים.",
  },
  {
    question: "איך עובדת רפלקסולוגיה?",
    answer:
      "הטיפול מתבצע באמצעות לחיצות על נקודות ספציפיות בכפות הרגליים או הידיים, הלחיצות מפעילות תהליכים לשחרור חסימות אנרגטיות ועידוד תהליכי ריפוי טבעיים בגוף.",
  },
  {
    question: "מהם היתרונות הבריאותיים של רפלקסולוגיה?",
    answer:
      "הרפלקסולוגיה עשויה לסייע בהפחתת מתחים, שיפור איכות השינה, הגברת זרימת הדם, שיפור העיכול והפחתת כאבים, כמו גם לעידוד רגיעה ואיזון נפשי.",
  },
  {
    question: "האם טיפול ברפלקסולוגיה כואב?",
    answer:
      "רוב המטופלים מתארים את הטיפול כעדין ונעים ללא כאבים.יש מקרים בהם  מתבקש בטיפול ללחיצות מעט חזקות אך הלחץ מותאם אישית לתחושת הנוחות של כל מטופל.",
  },
  {
    question: "כמה זמן נמשך טיפול טיפוסי?",
    answer:
      "מפגש טיפולי ברפלקסולוגיה נמשך כשעה, בהתאם לצרכי המטופל והמטרות הטיפוליות.",
  },
  {
    question: "האם יש תופעות לוואי בטיפול?",
    answer:
      "לרוב הטיפול אינו גורם לתופעות לוואי משמעותיות. ייתכן שתחושו עייפות קלה או שחרור רגשי לאחר הטיפול - תגובות נורמליות כחלק מתהליך הריפוי. לעיתים יש ריאקציות, תחושות באיברים שטופלו, אך הן חולפות במהרה.",
  },
  {
    question: "מי יכול לעבור טיפול ברפלקסולוגיה?",
    answer:
      "הרפלקסולוגיה מתאימה למבוגרים, לילדים ואף לנשים בהריון (בהתייעצות עם מומחה). מומלץ להתייעץ עם מטפל מוסמך לפני תחילת הטיפול, במיוחד במקרים מורכבים. לעיתים תתבקשו להביא התייעצות/המלצה של רופא מטפל. כדאי לזכור שראוי לתת למטפל מושג על מצבכם הבריאותי כדי שיתאים את הטיפול לצרכיהם.",
  },
  {
    question: "כמה מפגשים נדרשים להשגת תוצאות?",
    answer:
      "התוצאות תלויות במצב הבריאותי ובמטרות האישיות. לעיתים קרובות סדרת טיפולים של 5 עד 8 מפגשים יכולה להביא לשיפור ניכר בתחושת הרוגע והבריאות הכללית.",
  },
  {
    question: "האם הרפלקסולוגיה מתאימה לטיפול במחלות כרוניות?",
    answer:
      "הרפלקסולוגיה יכולה לשמש כטיפול משלימה לשיפור איכות החיים והפחתת תסמינים אצל מטופלים עם מחלות כרוניות - אך אינה מחליפה טיפול רפואי קונבנציונלי.",
  },
  {
    question: "כיצד לבחור מטפל רפלקסולוגי מקצועי?",
    answer:
      "חשוב לבחור מטפל בעל הסמכות, ניסיון והמלצות חיוביות. יש לוודא שהמטפל יוצר סביבה נעימה ובטוחה ומבין את הצרכים האישיים שלך.",
  },
];

const FAQ = () => {
  const [activeIndex, setActiveIndex] = useState(null);

  const toggleFAQ = (index) => {
    setActiveIndex(activeIndex === index ? null : index);
  };

  return (
    
    <section className="faq-section">
        <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.0.0/css/all.min.css"></link>
      <div className="section-header">
        <h2>שאלות ותשובות</h2>
        <p>
          כאן תמצאו תשובות לשאלות הנפוצות בנושא רפלקסולוגיה - כל מה שתרצו לדעת על הטיפול,
          היתרונות והתהליכים.
        </p>
        <br />
      </div>
      <div className="faq-container">
        {faqData.map((item, index) => (
          <div
            key={index}
            className={`faq-item ${activeIndex === index ? "active" : ""}`}
          >
            <div className="faq-question" onClick={() => toggleFAQ(index)}>
              <h3>{item.question}</h3>
              <i className={`fa ${activeIndex === index ? "fa-chevron-up" : "fa-chevron-down"}`}></i>
            </div>
            <div className="faq-answer">
              <p>{item.answer}</p>
            </div>
          </div>
        ))}
      </div>
    </section>
  );
};

export default FAQ;
